Public Member Functions | Public Attributes | Protected Member Functions | List of all members
ACAPI::MEP::v1::PreferenceTableContainerBase Class Reference
MEP Element Manager
The PreferenceTableContainerBase contains PreferenceTables, and you can Add/Get/Delete them. More...
#include <MEPPreferenceTableContainerBase.hpp>
 Inheritance diagram for ACAPI::MEP::v1::PreferenceTableContainerBase:
 Public Member Functions
bool  | Exists () const
std::vector< UniqueID >  | GetPreferenceTables () const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
~Modifier ()
Result< UniqueID >  | AddNewTable (GS::UniString tableName)
Inserts a new preference table into the container.
Result< void >  | Delete (const UniqueID &uniqueId)
Deletes a preference table from the container.
 Public Attributes
friend  | PreferenceTableContainerBase
 Protected Member Functions
PreferenceTableContainerBase (std::shared_ptr< Impl::IPreferenceTableContainerBaseImpl >)
~PreferenceTableContainerBase ()
Modifier (PreferenceTableContainerBase &)
Detailed Description
The PreferenceTableContainerBase contains PreferenceTables, and you can Add/Get/Delete them.
Since
Archicad 27
The containers for the three MEP domains are already initialized and you can get them from DuctPreferenceTableContainer, PipePreferenceTableContainer and CableCarrierPreferenceContainer
Example code snippet from Test / New MEP
Getters
 Reporter preferenceReporter;
 auto enumerateTableContent = [&](const PreferenceTableBase& table, PreferenceTableShape shape) {
 preferenceReporter.Add ("Preference name", table.GetName ());
 preferenceReporter.Add ("Shape of the table", shape);
 for (uint32_t i = 0; i < *table.GetSize (shape); ++i) {
 preferenceReporter.SetTabCount (1);
 preferenceReporter.Add ("Value", *table.GetValue (shape, i), false);
 preferenceReporter.SetTabCount (0);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Description", *table.GetDescription (shape, i));
 }
 preferenceReporter.AddNewLine ();
 };
 // Duct preferences
 {
 ACAPI::Result<DuctPreferenceTableContainer> container = GetDuctPreferenceTableContainer ();
 if (container.IsErr ())
 return container.UnwrapErr ().kind;
 std::vector<UniqueID> tableIds = container->GetPreferenceTables ();
 preferenceReporter.Add ("Duct preferences");
 for (UniqueID uniqueId : tableIds) {
 ACAPI::Result<PreferenceTableBase> table = PreferenceTableBase::Get (uniqueId);
 if (table.IsErr ())
 continue;
 enumerateTableContent (*table, PreferenceTableShape::Rectangular);
 enumerateTableContent (*table, PreferenceTableShape::Circular);
 }
 preferenceReporter.Write ();
 }
 // Pipe preferences
 {
 ACAPI::Result<PipePreferenceTableContainer> container = GetPipePreferenceTableContainer ();
 if (container.IsErr ())
 return container.UnwrapErr ().kind;
 std::vector<UniqueID> tableIds = container->GetPreferenceTables ();
 preferenceReporter.Add ("Pipe preferences");
 for (UniqueID uniqueId : tableIds) {
 ACAPI::Result<PreferenceTableBase> table = PreferenceTableBase::Get (uniqueId);
 if (table.IsErr ())
 continue;
 enumerateTableContent (*table, PreferenceTableShape::Circular);
 }
 preferenceReporter.Write ();
 }
 // Cable carrier preferences
 {
 ACAPI::Result<CableCarrierPreferenceTableContainer> container = GetCableCarrierPreferenceTableContainer ();
 if (container.IsErr ())
 return container.UnwrapErr ().kind;
 std::vector<UniqueID> tableIds = container->GetPreferenceTables ();
 preferenceReporter.Add ("CableCarrier preferences");
 for (UniqueID uniqueId : tableIds) {
 ACAPI::Result<PreferenceTableBase> table = PreferenceTableBase::Get (uniqueId);
 if (table.IsErr ())
 continue;
 enumerateTableContent (*table, PreferenceTableShape::Rectangular);
 }
 preferenceReporter.Write ();
 }
 Modification
 Reporter preferenceReporter;
 ACAPI::Result<DuctPreferenceTableContainer> container = GetDuctPreferenceTableContainer ();
 if (container.IsErr ())
 return container.UnwrapErr ().kind;
 preferenceReporter.Add ("Adding a new table to the duct container...");
 ACAPI::Result<void> modifyResult = container->Modify ([&](PreferenceTableContainerBase::Modifier& modifier) -> GSErrCode {
 ACAPI::Result<UniqueID> tableId = modifier.AddNewTable ("Duct sizes - added from MEP_Test");
 if (tableId.IsErr ())
 return tableId.UnwrapErr ().kind;
 return NoError;
 }, "Modify the content of duct container.");
 if (modifyResult.IsErr ())
 return modifyResult.UnwrapErr ().kind;
 preferenceReporter.Add ("New table successfully added.");
 preferenceReporter.AddNewLine ();
 std::vector<UniqueID> tableIds = container->GetPreferenceTables ();
 preferenceReporter.Add ("Deleting the first row of every shape of every duct table.");
 for (UniqueID uniqueId : tableIds) {
 ACAPI::Result<PreferenceTableBase> table = PreferenceTableBase::Get (uniqueId);
 if (table.IsErr ())
 continue;
 preferenceReporter.Add ("Trying to delete from", table->GetName ());
 table->Modify ([&](PreferenceTableBase::Modifier& modifier) {
 preferenceReporter.SetTabCount (1);
 ACAPI::Result<void> rDeleteResult = modifier.Delete (PreferenceTableShape::Rectangular, 0);
 if (rDeleteResult.IsOk ())
 preferenceReporter.Add ("Deletion of the first element from rectangular sizes was successful.");
 else
 preferenceReporter.Add ("Deletion unsuccessful", GS::UniString (rDeleteResult.UnwrapErr ().text));
 ACAPI::Result<void> cDeleteResult = modifier.Delete (PreferenceTableShape::Circular, 0);
 if (cDeleteResult.IsOk ())
 preferenceReporter.Add ("Deletion of the first element from circular sizes was successful.");
 else
 preferenceReporter.Add ("Deletion unsuccessful", GS::UniString (cDeleteResult.UnwrapErr ().text));
 }, "Delete from preference table.");
 preferenceReporter.SetTabCount (0);
 }
 preferenceReporter.Write ();
Constructor & Destructor Documentation
◆ PreferenceTableContainerBase()
 ACAPI::MEP::v1::PreferenceTableContainerBase::PreferenceTableContainerBase  |  ( |  std::shared_ptr< Impl::IPreferenceTableContainerBaseImpl >  |   | )
protected
◆ ~PreferenceTableContainerBase()
 ACAPI::MEP::v1::PreferenceTableContainerBase::~PreferenceTableContainerBase  |  ( |   | )
protected
◆ ~Modifier()
 ACAPI::MEP::v1::PreferenceTableContainerBase::~Modifier  |  ( |   | )
Member Function Documentation
◆ AddNewTable()
 Result< UniqueID > ACAPI::MEP::v1::PreferenceTableContainerBase::AddNewTable  |  ( |  GS::UniString  |  tableName | )
Inserts a new preference table into the container.
Parameters
tableName | The name of the table. It will be trimmed of leading and trailing whitespaces. This must be a non-empty and currently non-existent name in the container.
Returns
In case of successful insertion, returns the UniqueID of the newly inserted table.
◆ Delete()
 Result< void > ACAPI::MEP::v1::PreferenceTableContainerBase::Delete  |  ( |  const UniqueID &  |  uniqueId | )
Deletes a preference table from the container.
Parameters
uniqueId | The UniqueID of the table.
Returns
Returns an error if the parameter does not identify a PreferenceTable, otherwise nothing.
◆ Exists()
 bool ACAPI::MEP::v1::PreferenceTableContainerBase::Exists  |  ( |   | ) |   const
Returns
Checks if the object still exists.
◆ GetPreferenceTables()
 std::vector< UniqueID > ACAPI::MEP::v1::PreferenceTableContainerBase::GetPreferenceTables  |  ( |   | ) |   const
Returns
Returns the UniqueIDs of the PreferenceTables associated with the caller object's domain.
◆ Modifier()
 ACAPI::MEP::v1::PreferenceTableContainerBase::Modifier  |  ( |  PreferenceTableContainerBase &  |   | )
protected
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::PreferenceTableContainerBase::Modify  |  ( |  const ModifierFunc &  |  modifierFunc,
|  const GS::UniString &  |  undoString
)
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
Member Data Documentation
◆ PreferenceTableContainerBase
 friend ACAPI::MEP::v1::PreferenceTableContainerBase::PreferenceTableContainerBase